{
    "header": {
        "home": "Home",
        "sobre": "About",
        "habilidades": "Skills",
        "projetos": "Projects",
        "contato": "Contact"
    },
    "user": {
        "desc": "I am a Full Stack Developer with experience in Java, JavaScript, TypeScript, and SQL, and frameworks like React, React Native, and Node.js. I develop solutions integrating AI, databases, security, and automation, focused on functional and scalable systems. I have a collaborative, communicative, and results-driven profile, enhancing skills through practical projects and emerging technologies. I aim to deliver innovative solutions that create value and optimize processes, contributing to the growth of teams and organizations.",
        "fullstack": "Fullstack",
        "backend": "Backend",
        "ai": "AI",
        "software": "Software",
        "frontend": "Frontend"
    },
    "home": {
        "desenvolvedor": "Developer",
        "btnTexto01": "Download CV",
        "btnTexto02": "Get in Touch"
    },
    "destaquesSecao": {
        "titulo": "My Highlights",
        "subtitulo": "See some of my main works here.",
        "btnTexto": "See all Projects"
    },
    "footer": {
        "navegacao": "Navigation",
        "conecte": "Contact",
        "direitos": "All rights reserved."
    },
    "projetosSecao": {
        "titulo": "My Projects",
        "subtitulo": "See some of my projects here.",
        "filtros": {
            "all": "All"
        }
    },
    "sobreSecao": {
        "titulo": "About Me"
    },
    "experienciaSecao": {
        "titulo": "Experiences",
        "subtitulo": "See here a little about my journey."
    },
    "habilidadesSecao": {
        "titulo": "My Skills",
        "subtitulo": "See some of my technical skills here.",
        "filtros": {
            "todos": "All",
            "frontend": "Frontend",
            "backend": "Backend",
            "mobile": "Mobile",
            "database": "Database",
            "devops": "DevOps",
            "testing": "Testing",
            "design": "Design",
            "tools": "Tools",
            "outros": "Others"
        }
    },
    "estatisticasSecao": {
        "titulo": "Statistics",
        "estatisticas": {
            "projetos": "Projects",
            "anos": "Years",
            "clientes": "Clients",
            "dedicacao": "Dedication",
            "satisfacao": "Customer Satisfaction"
        }
    },
    "projetoModal": {
        "sobre": "About the project",
        "tecnologias": "Technologies Used",
        "btnTexto01": "Watch online",
        "btnTexto02": "See code"
    },
    "contatoSecao": {
        "titulo": "Contacts",
        "subtitulo": "Did you like what you saw? Reach out through one of these channels.",
        "cardEmail": {
            "titulo": "Send your message",
            "labelNome": "Name",
            "labelTelefone": "Phone",
            "labelMensagem": "Message",
            "btnTexto": "Send Message"
        },
        "titulo02": "Connect Through",
        "alert": "Please fill in all fields to send the message"
    },
    "chat": {
        "titulo": "Personal Assistant",
        "placeholder": "Type your message...",
        "mensagemInicial": "Hello! How can I help you today? Ask anything about Felipe."
    },
    "servicosSecao": {
        "titulo": "My Services",
        "subtitulo": "Complete solutions to transform your ideas into digital reality."
    },
    "servicos": {
        "sites": {
            "titulo": "Website Creation",
            "descricao": "Modern, responsive, and optimized institutional websites for your company"
        },
        "landing": {
            "titulo": "Landing Pages",
            "descricao": "Conversion-optimized pages to increase your sales and leads"
        },
        "ecommerce": {
            "titulo": "E-commerce",
            "descricao": "Complete online stores with payment system and product management"
        },
        "linkBio": {
            "titulo": "Link in Bio",
            "descricao": "Custom pages to centralize all your links and social media"
        },
        "manutencao": {
            "titulo": "Maintenance",
            "descricao": "Technical support, updates, and continuous improvements for your website"
        },
        "personalizado": {
            "titulo": "Custom Project",
            "descricao": "Tailor-made solutions for your business’s specific needs"
        }
    },
    "experiencias": {
        "experiencia01": {
            "papel": "Best Software Project of the Second Semester",
            "empresa": "PUC Minas",
            "descricao": "Recognized again as the Best Interdisciplinary Project in the Second Semester, maintaining the position of Second Best Interdisciplinary Project among all semesters of the course.",
            "tipo": "Study"
        },
        "experiencia02": {
            "papel": "Freelancer - Web Development",
            "empresa": "Voogle",
            "descricao": "I developed a personalized web page for a client, meeting their specific design and functionality needs. For the project, I used React, TypeScript, and Tailwind to build a responsive and intuitive interface. I delivered the project within the agreed timeframe, achieving high client satisfaction.",
            "tipo": "Work"
        },
        "experiencia03": {
            "papel": "Best Software Project of the First Semester",
            "empresa": "PUC Minas",
            "descricao": "Received recognition as the Best Interdisciplinary Project of the First Semester and was ranked as the Second Best Interdisciplinary Project among all semesters of the course.",
            "tipo": "Study"
        },
        "experiencia04": {
            "papel": "Software Engineering",
            "empresa": "PUC Minas",
            "descricao": "Project-oriented education with a solid foundation in architecture, data structures, databases, and embedded systems. Emphasis on best practices (such as testing, version control, and CI/CD), agile methodologies, and AI fundamentals to build scalable, secure, and production-ready solutions.",
            "tipo": "Study"
        }
    },
    "projects": {
        "btnTexto": "See Details",
        "types": {
            "sites": "Websites",
            "landing": "Landing Pages",
            "apps": "Apps",
            "ecommerce": "E-Commerce",
            "others": "Others"
        },
        "status": {
            "inProgress": "In Progress",
            "done": "Finished"
        },
        "GestorX": {
            "title": "Business Management",
            "description": "GestorX is a complete business management solution designed to centralize and optimize your company's internal processes. It brings together sales, purchasing, inventory, and financial modules in a single intuitive platform, ensuring full control over operations and results. With dynamic reports and customizable dashboards, it provides strategic support for faster decision-making, reduces operational costs, and increases business efficiency."
        },
        "Portifolio": {
            "title": "Portifolio",
            "description": "Este portfólio foi pensado para ser dinâmico e conversacional. Além de apresentar meus projetos, experiências e contato, ele traz um assistente de IA que ajuda visitantes a navegar e entender rapidamente o que faço: explica tecnologias usadas, sugere projetos relevantes e responde dúvidas frequentes. A proposta é transformar o portfólio em uma experiência guiada, com descobertas contextualizadas e interação natural."
        },
        "G-agro": {
            "title": "G-AGRO",
            "description": "O G-Agro é um sistema voltado a produtores e gestores do agronegócio, oferecendo uma visão unificada das operações no campo. Permite organizar propriedades e áreas de produção, acompanhar insumos e atividades (plantio, tratos, colheita), registrar custos e visualizar desempenho por safra. Com painéis sintéticos, facilita a identificação de gargalos, o controle de estoque e a análise de rentabilidade."
        },
        "BasicoBemFeito": {
            "title": "Básico Bem Feito",
            "description": "O Básico Bem Feito nasce da ideia de que simplicidade e capricho elevam a experiência do usuário. É um site estático para academia, construído com atenção a layout responsivo, tipografia legível e acessibilidade. Inclui uma funcionalidade simples de criação de fichas de treino e seções essenciais como planos, horários e contato. Um projeto que prioriza boas práticas de front-end desde o início da jornada."
        },
        "Optima": {
            "title": "Optima",
            "description": "O Optima é um sistema de gestão empresarial que integra os principais processos de uma empresa em um só lugar. Abrange módulos de vendas, compras, estoque e financeiro, permitindo controle do fluxo de ponta a ponta — da entrada de pedidos ao acompanhamento de margens e lucros. Com painéis e relatórios personalizáveis, apoia decisões rápidas e embasadas, reduzindo retrabalho e aumentando a visibilidade operacional."
        },
        "Ajunta": {
            "title": "Ajunta",
            "description": "A Ajunta é uma rede social criada para valorizar e integrar a cena artística de Contagem. Artistas podem criar perfis, publicar trabalhos, se conectar com outros criadores e descobrir oportunidades locais. O objetivo é fortalecer o ecossistema cultural, facilitar parcerias e dar visibilidade a talentos por meio de portfólios, eventos e interações em comunidade."
        },
        "Voogle": {
            "title": "Voogle",
            "description": "A Ajunta é uma rede social criada para valorizar e integrar a cena artística de Contagem. Artistas podem criar perfis, publicar trabalhos, se conectar com outros criadores e descobrir oportunidades locais. O objetivo é fortalecer o ecossistema cultural, facilitar parcerias e dar visibilidade a talentos por meio de portfólios, eventos e interações em comunidade."
        }
    }
}