{
    "header": {
        "home": "Home",
        "sobre": "Sobre",
        "habilidades": "Habilidades",
        "projetos": "Projetos",
        "contato": "Contato"
    },
    "user": {
        "desc": "Sou Desenvolvedor Full Stack com experiência em Java, JavaScript, TypeScript e SQL, e frameworks como React, React Native e Node.js. Desenvolvo soluções que unem IA, bancos de dados, segurança e automação, focando em sistemas funcionais e escaláveis. Possuo perfil colaborativo, comunicativo e orientado a resultados, aprimorando habilidades por meio de projetos práticos e novas tecnologias. Busco entregar soluções inovadoras que gerem valor e otimizem processos, contribuindo para o crescimento das equipes e da organização.",
        "fullstack": "Fullstack",
        "backend": "Backend",
        "ai": "de IA",
        "software": "de Software",
        "frontend": "Frontend"
    },
    "home": {
        "desenvolvedor": "Desenvolvedor",
        "btnTexto01": "Baixar Currículo",
        "btnTexto02": "Entrar em Contato"
    },
    "destaquesSecao": {
        "titulo": "Meus Destaques",
        "subtitulo": "Veja aqui alguns dos meus principais trabalhos.",
        "btnTexto": "Ver Todos os Projetos"
    },
    "footer": {
        "navegacao": "Navegação",
        "conecte": "Conecte-se",
        "direitos": "Todos os direitos reservados."
    },
    "projetosSecao": {
        "titulo": "Meus Projetos",
        "subtitulo": "Veja aqui um pouco dos meus projetos.",
        "filtros": {
            "all": "Todos"
        }
    },
    "sobreSecao": {
        "titulo": "Sobre Mim"
    },
    "experienciaSecao": {
        "titulo": "Experiências",
        "subtitulo": "Veja aqui um pouco sobre a minha jornada."
    },
    "habilidadesSecao": {
        "titulo": "Minhas Habilidades",
        "subtitulo": "Veja aqui um pouco das minhas habilidades técnicas.",
        "filtros": {
            "todos": "Todos",
            "frontend": "Frontend",
            "backend": "Backend",
            "mobile": "Mobile",
            "database": "Database",
            "devops": "DevOps",
            "testing": "Testing",
            "design": "Design",
            "tools": "Tools",
            "outros": "Outros"
        }
    },
    "estatisticasSecao": {
        "titulo": "Estatísticas",
        "estatisticas": {
            "projetos": "Projetos",
            "anos": "Anos",
            "clientes": "Clientes",
            "dedicacao": "Dedicação",
            "satisfacao": "Satisfação do Cliente"
        }
    },
    "projetoModal": {
        "sobre": "Sobre o Projeto",
        "tecnologias": "Tecnologias Utilizadas",
        "btnTexto01": "Ver Online",
        "btnTexto02": "Ver Código"
    },
    "contatoSecao": {
        "titulo": "Contatos",
        "subtitulo": "Gostou do que viu? Me chame por um desses canais.",
        "cardEmail": {
            "titulo": "Envie sua mensagem",
            "labelNome": "Nome",
            "labelTelefone": "Telefone",
            "labelMensagem": "Mensagem",
            "btnTexto": "Enviar Mensagem"
        },
        "titulo02": "Conecte-se Por",
        "alert": "Por Favor preencha todas os campos para enviar a mensagem"
    },
    "chat": {
        "titulo": "Assistente Pessoal",
        "placeholder": "Digite sua mensagem...",
        "mensagemInicial": "Olá! Como posso ajudar hoje? Pergunte qualquer coisa sobre o Felipe."
    },
    "servicosSecao": {
        "titulo": "Meus Serviços",
        "subtitulo": "Soluções completas para transformar suas ideias em realidade digital."
    },
    "servicos": {
        "sites": {
            "titulo": "Criação de Sites",
            "descricao": "Sites institucionais modernos, responsivos e otimizados para sua empresa"
        },
        "landing": {
            "titulo": "Landing Pages",
            "descricao": "Páginas de conversão otimizadas para aumentar suas vendas e leads"
        },
        "ecommerce": {
            "titulo": "E-commerces",
            "descricao": "Lojas virtuais completas com sistema de pagamentos e gestão de produtos"
        },
        "linkBio": {
            "titulo": "Link na Bio",
            "descricao": "Páginas personalizadas para centralizar todos seus links e redes sociais"
        },
        "manutencao": {
            "titulo": "Manutenção",
            "descricao": "Suporte técnico, atualizações e melhorias contínuas para seu site"
        },
        "personalizado": {
            "titulo": "Projeto Personalizado",
            "descricao": "Soluções sob medida para necessidades específicas do seu negócio"
        }
    },
    "experiencias": {
        "experiencia01": {
            "papel": "Melhor Projeto de Software do Segundo Período",
            "empresa": "PUC Minas",
            "descricao": "Reconhecido novamente com o título de Melhor Projeto Interdisciplinar no Segundo Período, mantendo a posição de Segundo Melhor Projeto Interdisciplinar entre todos os períodos do curso.",
            "tipo": "Estudo"
        },
        "experiencia02": {
            "papel": "Freelancer - Desenvolvimento Web",
            "empresa": "Voogle",
            "descricao": "Desenvolvi uma página web personalizada para um cliente, atendendo às suas necessidades específicas de design e funcionalidade. Para o desenvolvimento do projeto, utilizei React, TypeScript, Tailwind para criar uma interface responsiva e intuitiva. Entreguei o projeto dentro do prazo estipulado, com alta satisfação do cliente.",
            "tipo": "Trabalho"
        },
        "experiencia03": {
            "papel": "Melhor Projeto de Software do Primeiro Período",
            "empresa": "PUC Minas",
            "descricao": "Recebi o reconhecimento como Melhor Projeto Interdisciplinar do Primeiro Período e fui classificado como o Segundo Melhor Projeto Interdisciplinar entre todos os períodos do curso",
            "tipo": "Estudo"
        },
        "experiencia04": {
            "papel": "Engenharia de Software",
            "empresa": "PUC Minas",
            "descricao": "Formação orientada a projetos com base sólida em arquitetura, estruturas de dados, bancos de dados e sistemas embarcados. Ênfase em boas práticas (como testes, versionamento e CI/CD), métodos ágeis e fundamentos de IA para construir soluções escaláveis, seguras e prontas para produção.",
            "tipo": "Estudo"
        }
    },
    "projects": {
        "btnTexto": "Ver Detalhes",
        "types": {
            "sites": "Sites",
            "landing": "Landing Pages",
            "apps": "Aplicativos",
            "ecommerce": "E-Commerce",
            "others": "Outros"
        },
        "status": {
            "inProgress": "Em Andamento",
            "done": "Finalizado"
        },
        "GestorX": {
            "title": "Gestor Empresarial",
            "description": "O GestorX é uma solução completa de gestão empresarial desenvolvida para centralizar e otimizar os processos internos da sua empresa. Reúne módulos de vendas, compras, estoque e financeiro em uma única plataforma intuitiva, garantindo controle total sobre operações e resultados. Com relatórios dinâmicos e painéis personalizáveis, oferece suporte estratégico para decisões mais rápidas, reduz custos operacionais e amplia a eficiência do negócio."
        },
        "Portifolio": {
            "title": "Portifolio",
            "description": "Este portfólio foi pensado para ser dinâmico e conversacional. Além de apresentar meus projetos, experiências e contato, ele traz um assistente de IA que ajuda visitantes a navegar e entender rapidamente o que faço: explica tecnologias usadas, sugere projetos relevantes e responde dúvidas frequentes. A proposta é transformar o portfólio em uma experiência guiada, com descobertas contextualizadas e interação natural."
        },
        "G-agro": {
            "title": "G-AGRO",
            "description": "O G-Agro é um sistema voltado a produtores e gestores do agronegócio, oferecendo uma visão unificada das operações no campo. Permite organizar propriedades e áreas de produção, acompanhar insumos e atividades (plantio, tratos, colheita), registrar custos e visualizar desempenho por safra. Com painéis sintéticos, facilita a identificação de gargalos, o controle de estoque e a análise de rentabilidade."
        },
        "BasicoBemFeito": {
            "title": "Básico Bem Feito",
            "description": "O Básico Bem Feito nasce da ideia de que simplicidade e capricho elevam a experiência do usuário. É um site estático para academia, construído com atenção a layout responsivo, tipografia legível e acessibilidade. Inclui uma funcionalidade simples de criação de fichas de treino e seções essenciais como planos, horários e contato. Um projeto que prioriza boas práticas de front-end desde o início da jornada."
        },
        "Optima": {
            "title": "Optima",
            "description": "O Optima é um sistema de gestão empresarial que integra os principais processos de uma empresa em um só lugar. Abrange módulos de vendas, compras, estoque e financeiro, permitindo controle do fluxo de ponta a ponta — da entrada de pedidos ao acompanhamento de margens e lucros. Com painéis e relatórios personalizáveis, apoia decisões rápidas e embasadas, reduzindo retrabalho e aumentando a visibilidade operacional."
        },
        "Ajunta": {
            "title": "Ajunta",
            "description": "A Ajunta é uma rede social criada para valorizar e integrar a cena artística de Contagem. Artistas podem criar perfis, publicar trabalhos, se conectar com outros criadores e descobrir oportunidades locais. O objetivo é fortalecer o ecossistema cultural, facilitar parcerias e dar visibilidade a talentos por meio de portfólios, eventos e interações em comunidade."
        },
        "Voogle": {
            "title": "Voogle",
            "description": "A Ajunta é uma rede social criada para valorizar e integrar a cena artística de Contagem. Artistas podem criar perfis, publicar trabalhos, se conectar com outros criadores e descobrir oportunidades locais. O objetivo é fortalecer o ecossistema cultural, facilitar parcerias e dar visibilidade a talentos por meio de portfólios, eventos e interações em comunidade."
        }
    }
}